{"_id":{"$oid":"5c9f763fdbfa1a275c2d180f"},"id":{"$numberInt":"1"},"productName":"Captain Marvel Socks","productPrice":{"$numberInt":"50"},"productDesc":"From the extraordinary mind of Stan Lee all the way to box office, smash hit, the heroics of Captain Marvel has captivated millions, on both comic strip and silver screen alike. Appease your inner nerd with Captain Marvel, our one of a kind homage to the classic super hero and all his timeless adventures.","productMaterial":"54% Combed Cotton, 24% Polyester, 10% Lurex, 9% Nylon, 3% Elastane","productDimen":"4 x 0.1 x 2 inches","productColor":"Red, Blue, Yellow","productImg":"../assets/images/product-images/1.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac355f357269130c8ab23b"},"id":{"$numberInt":"2"},"productName":"Hulk t-shirt","productPrice":{"$numberInt":"40"},"productDesc":"This heather-gray Hulk t-shirt for men sports a classic cover from a classic story involving a classic meeting leading to classic, catastrophic amounts of smashing","productMaterial":"90% cotton, 10% polyester","productDimen":"9 x 9 x 0.8 inches","productColor":"White, Green, Purple","productImg":"../assets/images/product-images/2.png","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac360b357269130c8ab23c"},"id":{"$numberInt":"3"},"productName":"Thor Mug","productPrice":{"$numberInt":"25"},"productDesc":"Only the worthiest of gods and mortals can lift the mighty Thors hammer Mjölnir - let alone drink from it! You will feel like a super hero when you quaff coffee or mead from this fully sculptured mug.","productMaterial":"100% Ceramic","productDimen":"6 x 5.1 x 6.1 inches","productColor":"Grey, Brown","productImg":"../assets/images/product-images/3.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac5219357269130c8ab23d"},"id":{"$numberInt":"4"},"productName":"Doctor Strange Onesie","productPrice":{"$numberInt":"34"},"productDesc":"Our Infant Bodysuits Will Look Absolutely Adorable On Your Little One! This Exclusive Design Is Available On Multiple Size And Color Combinations Of Your Choice. Available Sizes And Colors Are Selectable. Bodysuits Feature Lap Shoulder Construction For Over-the-head Ease And Three Button Snap Closure For A Diaper Friendly Fit.","productMaterial":"100% cotton","productDimen":"17 x 10 inches","productColor":"Grey","productImg":"../assets/images/product-images/4.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac5262357269130c8ab23e"},"id":{"$numberInt":"5"},"productName":"Iron Man Mask","productPrice":{"$numberInt":"38"},"productDesc":"Heroes face off as the Super Hero universe divides into separate side, and it’s time to decide which team to join forces with! Which side will prevail? Who will be defeated? In the epic battle of Super Hero versus Super Hero, there’s no telling who might win! This movie-inspired Iron Man mask includes a flexible band to fit most ordinary mortals, so you can pretend to be superhuman! Superpowers not included. Copyright 2015 Marvel. Hasbro and all related terms are trademarks of Hasbro.","productMaterial":"100% plastic","productDimen":"4.3 x 7.5 x 12 inches","productColor":"Red, Yellow","productImg":"../assets/images/product-images/5.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac52fc357269130c8ab23f"},"id":{"$numberInt":"6"},"productName":"Black Widow Sticker","productPrice":{"$numberInt":"5"},"productDesc":"Brand new vinyl wall decal with a small die-cut opaque border and background. Highest Quality Official Marvel Comics merchandise.","productMaterial":"100% Vinyl","productDimen":"4 x 5.5 inches","productColor":"Multi","productImg":"../assets/images/product-images/6.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac537c357269130c8ab240"},"id":{"$numberInt":"7"},"productName":"Captain America Phone Cover","productPrice":{"$numberInt":"60"},"productDesc":"This hybrid case offers 2 layers of protection - rugged plastic shell casing, and rubbery silicone impact absorbing sleeve. The rubbery silicone material makes it easier for you to get a grip on your phone while plastic shell casing protecting it from accidental bumps and drops. Protect your valuable phone with this rugged case!!!","productMaterial":"60% PC, 40% Silicone","productDimen":"6.3 x 2.9 x 1.2 inches","productColor":"Red, Silver, Blue","productImg":"../assets/images/product-images/7.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac53e1357269130c8ab241"},"id":{"$numberInt":"8"},"productName":"Spiderman Water Bottle","productPrice":{"$numberInt":"32"},"productDesc":"A day of fun awaits you today, so get out and play! Stay hydrated along the way with the Vandor Spider-Man 32-Ounce Tritan Water Bottle. This fun water bottle is BPA-Free, reusable, recyclable and has a leak-proof, loop-top cap for greater functionality on-the-go. Made from durable Eastman Tritan plastic, it features a wide mouth for easy filling and cleaning. Making retro cool since 1957, legends live on at Vandor - suppliers of hip and functional products for fans of all ages.","productMaterial":"100% Plastic","productDimen":"3.4 x 10.4 x 3.4 inches","productColor":"Red, Blue, Black","productImg":"../assets/images/product-images/8.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac5447357269130c8ab242"},"id":{"$numberInt":"9"},"productName":"Thanos Statue","productPrice":{"$numberInt":"340"},"productDesc":"Known as the \"Mad Titan,\" Thanos is a massively powerful alien who first appeared in the pages of Marvel Comics back in 1973 and has been a menace ever since. With his popularity reaching new heights thanks to his appearance in the Marvel Cinematic Universe, Thanos is the perfect new addition to the Fine Art Statue lineup. Always willing to get his hands dirty to further his own schemes, Thanos has arrived to unleash untold destruction on any who would stand in his way! The Mad Titan stands invincible on the battlefield, reveling in his own might as he sweeps away his foes with a clenched fist and the power of the Infinity Gauntlet. His massive frame is garbed in his iconic blue and gold costume, a segmented and reinforced bodysuit with armor plating, huge gloves and boots, a protective skirt, and a wide collar. All of that adds bulk to his already huge physique, and the amazing sculpt shows off both his musculature and the intricate details of his suit. And while his fist may seem intimidating, it is really his left hand that is the most dangerous for it bears the Gauntlet, expertly recreated with the six differently-colored Gems. The only uncovered part of Thanos is his face, and you have two great options for your display: the Mad Titan giving a sly smile or baring his teeth in a fearsome grimace! Thanos stands an incredible 15 inches tall as he poses on the skulls of his defeated enemies. Guaranteed to make a big impact in your collection, this Fine Art Statue is the quintessential collectible of the iconic Marvel villain.","productMaterial":"100% Polystone","productDimen":"6 x 5 x 12 inches","productColor":"Multi","productImg":"../assets/images/product-images/9.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac54ea357269130c8ab243"},"id":{"$numberInt":"10"},"productName":"Scarlet Witch Hoodie","productPrice":{"$numberInt":"60"},"productDesc":"Avengers: Infinity War! Time For All Of Our Favourite MCU Characters To Join Forces And Take On The Might Of Thanos In A Battle For The Ages. Whilst You Might Not Be Able To Wear Your Own Infinity Gauntlet, We Can Help You Out With This Great Range Of Officially Licensed Clothing In Line With The Biggest Marvel Release Of The Year. With Loads Of Great T-shirt And Sweatshirt Designs, You will Be Able To Take On Even The Most Fearsome Intergalactic Super-villains And Side With The Avengers, The Guardians Of The Galaxy And All Of Your Other Favourite MCU Superheroes!'","productMaterial":"80% Cotton, 20% Polyester","productDimen":"23 x 29 inches","productColor":"Black, Red","productImg":"../assets/images/product-images/10.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac5543357269130c8ab244"},"id":{"$numberInt":"11"},"productName":"Hawkeye Notebook","productPrice":{"$numberInt":"15"},"productDesc":"Organize your day with a custom notebook! Made with your images and text on the front cover, this notebook is a great way to show off your personal style and keep track of all important notes and appointments all at once.',     ","productMaterial":"128 pages, 90gsm stock paper","productDimen":"12 x 6 inches","productColor":"Purple","productImg":"../assets/images/product-images/11.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac558c357269130c8ab245"},"id":{"$numberInt":"12"},"productName":"Antman Mousepad","productPrice":{"$numberInt":"22"},"productDesc":"Awesome! Take your gaming to new, smoother levels with this Fandom Realm Mouse Pad. The low-friction micro surface reduces drag for in-the-moment play, Now do not just see it Buy it!'","productMaterial":"90% rubber, 10% polyester","productDimen":"6 x 0.3 x 9 inches","productColor":"Multi","productImg":"../assets/images/product-images/12.jpg","productQuantity":{"$numberInt":"0"}}
{"_id":{"$oid":"5cac55d0357269130c8ab246"},"id":{"$numberInt":"13"},"productName":"Vision Cap","productPrice":{"$numberInt":"30"},"productDesc":"Marvels mightiest heroes are about to reassemble in the new movie avengers age of ultron. Join forces with them in this new era 59Fifty fitted cap. The patent leather 59Fifty features a character logo on the front panel in patent leather, with a raised embroidery logo at the back, the new era flag on the wearers left side and a snapback closure. These caps also feature high resolution art on both the inside lining and the undervisor. Face the threat of ultron and look great doing it","productMaterial":"100% Patent Leather","productDimen":"8.8 x 7.2 x 3.8 inches","productColor":"Green, Red, Yellow","productImg":"../assets/images/product-images/13.jpg","productQuantity":{"$numberInt":"0"}}
